; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_11_12)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - person
	)

  (:init
		(= (x b0) 10)
(= (y b0) 0)
(= (x b1) 10)
(= (y b1) 0)
(= (x b2) 8)
(= (y b2) 0)
(= (x b3) -8)
(= (y b3) 0)
(= (x b4) -7)
(= (y b4) 0)
(= (x b5) 2)
(= (y b5) 0)
(= (x b6) -3)
(= (y b6) 0)
(= (x b7) 0)
(= (y b7) 0)
(= (x b8) -7)
(= (y b8) 0)
(= (x b9) -6)
(= (y b9) 0)
(= (x b10) 1)
(= (y b10) 0)

		(= (d p0) 76)
(= (d p1) 19)
(= (d p2) 21)
(= (d p3) 2)
(= (d p4) 85)
(= (d p5) 76)
(= (d p6) 71)
(= (d p7) 74)
(= (d p8) 18)
(= (d p9) 0)
(= (d p10) 99)
(= (d p11) 7)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
		)
	)
)

; plan
1. (save_person b7 p9)
   added: (saved p9)
   goals met: 1 of 12
2. (go_north_east b7)
   changed: (x b7) from 0 to 1.5, (y b7) from 0 to 1.5
   goals met: 1 of 12
3. (go_north_east b7)
   changed: (x b7) from 1.5 to 3, (y b7) from 1.5 to 3
   goals met: 1 of 12
4. (go_north_east b7)
   changed: (x b7) from 3 to 4.5, (y b7) from 3 to 4.5
   goals met: 1 of 12
5. (go_north_east b7)
   changed: (x b7) from 4.5 to 6, (y b7) from 4.5 to 6
   goals met: 1 of 12
6. (go_north_east b7)
   changed: (x b7) from 6 to 7.5, (y b7) from 6 to 7.5
   goals met: 1 of 12
7. (go_north_east b7)
   changed: (x b7) from 7.5 to 9, (y b7) from 7.5 to 9
   goals met: 1 of 12
8. (go_north_east b7)
   changed: (x b7) from 9 to 10.5, (y b7) from 9 to 10.5
   goals met: 1 of 12
9. (go_north_west b7)
   changed: (x b7) from 10.5 to 9, (y b7) from 10.5 to 12
   goals met: 1 of 12
10. (save_person b7 p3)
   added: (saved p3)
   goals met: 2 of 12
11. (go_north_west b7)
   changed: (x b7) from 9 to 7.5, (y b7) from 12 to 13.5
   goals met: 2 of 12
12. (go_north_west b7)
   changed: (x b7) from 7.5 to 6, (y b7) from 13.5 to 15
   goals met: 2 of 12
13. (save_person b7 p11)
   added: (saved p11)
   goals met: 3 of 12
14. (go_north_west b7)
   changed: (x b7) from 6 to 4.5, (y b7) from 15 to 16.5
   goals met: 3 of 12
15. (go_north_west b7)
   changed: (x b7) from 4.5 to 3, (y b7) from 16.5 to 18
   goals met: 3 of 12
16. (go_north_west b7)
   changed: (x b7) from 3 to 1.5, (y b7) from 18 to 19.5
   goals met: 3 of 12
17. (save_person b7 p8)
   added: (saved p8)
   goals met: 4 of 12
18. (go_north_west b7)
   changed: (x b7) from 1.5 to 0, (y b7) from 19.5 to 21
   goals met: 4 of 12
19. (save_person b7 p2)
   added: (saved p2)
   goals met: 5 of 12
20. (go_north_east b7)
   changed: (x b7) from 0 to 1.5, (y b7) from 21 to 22.5
   goals met: 5 of 12
21. (go_north_east b7)
   changed: (x b7) from 1.5 to 3, (y b7) from 22.5 to 24
   goals met: 5 of 12
22. (go_north_east b7)
   changed: (x b7) from 3 to 4.5, (y b7) from 24 to 25.5
   goals met: 5 of 12
23. (go_north_east b7)
   changed: (x b7) from 4.5 to 6, (y b7) from 25.5 to 27
   goals met: 5 of 12
24. (go_north_east b7)
   changed: (x b7) from 6 to 7.5, (y b7) from 27 to 28.5
   goals met: 5 of 12
25. (go_north_east b7)
   changed: (x b7) from 7.5 to 9, (y b7) from 28.5 to 30
   goals met: 5 of 12
26. (go_north_east b7)
   changed: (x b7) from 9 to 10.5, (y b7) from 30 to 31.5
   goals met: 5 of 12
27. (go_north_east b7)
   changed: (x b7) from 10.5 to 12, (y b7) from 31.5 to 33
   goals met: 5 of 12
28. (go_north_east b7)
   changed: (x b7) from 12 to 13.5, (y b7) from 33 to 34.5
   goals met: 5 of 12
29. (go_north_east b7)
   changed: (x b7) from 13.5 to 15, (y b7) from 34.5 to 36
   goals met: 5 of 12
30. (go_north_east b7)
   changed: (x b7) from 15 to 16.5, (y b7) from 36 to 37.5
   goals met: 5 of 12
31. (go_north_east b7)
   changed: (x b7) from 16.5 to 18, (y b7) from 37.5 to 39
   goals met: 5 of 12
32. (go_north_east b7)
   changed: (x b7) from 18 to 19.5, (y b7) from 39 to 40.5
   goals met: 5 of 12
33. (go_north_east b7)
   changed: (x b7) from 19.5 to 21, (y b7) from 40.5 to 42
   goals met: 5 of 12
34. (go_north_east b7)
   changed: (x b7) from 21 to 22.5, (y b7) from 42 to 43.5
   goals met: 5 of 12
35. (go_north_east b7)
   changed: (x b7) from 22.5 to 24, (y b7) from 43.5 to 45
   goals met: 5 of 12
36. (go_north_east b7)
   changed: (x b7) from 24 to 25.5, (y b7) from 45 to 46.5
   goals met: 5 of 12
37. (go_west b7)
   changed: (x b7) from 25.5 to 22.5
   goals met: 5 of 12
38. (go_west b7)
   changed: (x b7) from 22.5 to 19.5
   goals met: 5 of 12
39. (go_west b7)
   changed: (x b7) from 19.5 to 16.5
   goals met: 5 of 12
40. (go_west b7)
   changed: (x b7) from 16.5 to 13.5
   goals met: 5 of 12
41. (go_north_west b7)
   changed: (x b7) from 13.5 to 12, (y b7) from 46.5 to 48
   goals met: 5 of 12
42. (go_north_west b7)
   changed: (x b7) from 12 to 10.5, (y b7) from 48 to 49.5
   goals met: 5 of 12
43. (go_north_west b7)
   changed: (x b7) from 10.5 to 9, (y b7) from 49.5 to 51
   goals met: 5 of 12
44. (go_north_west b7)
   changed: (x b7) from 9 to 7.5, (y b7) from 51 to 52.5
   goals met: 5 of 12
45. (go_north_west b7)
   changed: (x b7) from 7.5 to 6, (y b7) from 52.5 to 54
   goals met: 5 of 12
46. (go_north_west b7)
   changed: (x b7) from 6 to 4.5, (y b7) from 54 to 55.5
   goals met: 5 of 12
47. (go_north_west b7)
   changed: (x b7) from 4.5 to 3, (y b7) from 55.5 to 57
   goals met: 5 of 12
48. (go_north_west b7)
   changed: (x b7) from 3 to 1.5, (y b7) from 57 to 58.5
   goals met: 5 of 12
49. (go_north_west b7)
   changed: (x b7) from 1.5 to 0, (y b7) from 58.5 to 60
   goals met: 5 of 12
50. (go_north_west b7)
   changed: (x b7) from 0 to -1.5, (y b7) from 60 to 61.5
   goals met: 5 of 12
51. (go_north_west b7)
   changed: (x b7) from -1.5 to -3, (y b7) from 61.5 to 63
   goals met: 5 of 12
52. (go_north_east b7)
   changed: (x b7) from -3 to -1.5, (y b7) from 63 to 64.5
   goals met: 5 of 12
53. (go_north_east b7)
   changed: (x b7) from -1.5 to 0, (y b7) from 64.5 to 66
   goals met: 5 of 12
54. (go_north_east b7)
   changed: (x b7) from 0 to 1.5, (y b7) from 66 to 67.5
   goals met: 5 of 12
55. (go_north_east b7)
   changed: (x b7) from 1.5 to 3, (y b7) from 67.5 to 69
   goals met: 5 of 12
56. (go_north_east b10)
   changed: (x b10) from 1 to 2.5, (y b10) from 0 to 1.5
   goals met: 5 of 12
57. (go_north_east b10)
   changed: (x b10) from 2.5 to 4, (y b10) from 1.5 to 3
   goals met: 5 of 12
58. (go_north_east b10)
   changed: (x b10) from 4 to 5.5, (y b10) from 3 to 4.5
   goals met: 5 of 12
59. (go_north_east b10)
   changed: (x b10) from 5.5 to 7, (y b10) from 4.5 to 6
   goals met: 5 of 12
60. (go_north_east b10)
   changed: (x b10) from 7 to 8.5, (y b10) from 6 to 7.5
   goals met: 5 of 12
61. (go_north_east b10)
   changed: (x b10) from 8.5 to 10, (y b10) from 7.5 to 9
   goals met: 5 of 12
62. (go_north_east b7)
   changed: (x b7) from 3 to 4.5, (y b7) from 69 to 70.5
   goals met: 5 of 12
63. (go_north_east b7)
   changed: (x b7) from 4.5 to 6, (y b7) from 70.5 to 72
   goals met: 5 of 12
64. (go_north_east b7)
   changed: (x b7) from 6 to 7.5, (y b7) from 72 to 73.5
   goals met: 5 of 12
65. (go_north_east b7)
   changed: (x b7) from 7.5 to 9, (y b7) from 73.5 to 75
   goals met: 5 of 12
66. (go_north_east b7)
   changed: (x b7) from 9 to 10.5, (y b7) from 75 to 76.5
   goals met: 5 of 12
67. (go_north_east b7)
   changed: (x b7) from 10.5 to 12, (y b7) from 76.5 to 78
   goals met: 5 of 12
68. (go_north_east b7)
   changed: (x b7) from 12 to 13.5, (y b7) from 78 to 79.5
   goals met: 5 of 12
69. (go_north_east b7)
   changed: (x b7) from 13.5 to 15, (y b7) from 79.5 to 81
   goals met: 5 of 12
70. (go_north_east b7)
   changed: (x b7) from 15 to 16.5, (y b7) from 81 to 82.5
   goals met: 5 of 12
71. (go_west b7)
   changed: (x b7) from 16.5 to 13.5
   goals met: 5 of 12
72. (go_north_west b7)
   changed: (x b7) from 13.5 to 12, (y b7) from 82.5 to 84
   goals met: 5 of 12
73. (save_person b7 p6)
   added: (saved p6)
   goals met: 6 of 12
74. (go_north_west b7)
   changed: (x b7) from 12 to 10.5, (y b7) from 84 to 85.5
   goals met: 6 of 12
75. (save_person b7 p7)
   added: (saved p7)
   goals met: 7 of 12
76. (go_north_west b7)
   changed: (x b7) from 10.5 to 9, (y b7) from 85.5 to 87
   goals met: 7 of 12
77. (save_person b7 p5)
   added: (saved p5)
   goals met: 8 of 12
78. (save_person b7 p0)
   added: (saved p0)
   goals met: 9 of 12
79. (go_north_west b7)
   changed: (x b7) from 9 to 7.5, (y b7) from 87 to 88.5
   goals met: 9 of 12
80. (go_north_west b7)
   changed: (x b7) from 7.5 to 6, (y b7) from 88.5 to 90
   goals met: 9 of 12
81. (go_north_west b7)
   changed: (x b7) from 6 to 4.5, (y b7) from 90 to 91.5
   goals met: 9 of 12
82. (save_person b7 p4)
   added: (saved p4)
   goals met: 10 of 12
83. (go_north_east b7)
   changed: (x b7) from 4.5 to 6, (y b7) from 91.5 to 93
   goals met: 10 of 12
84. (go_north_west b7)
   changed: (x b7) from 6 to 4.5, (y b7) from 93 to 94.5
   goals met: 10 of 12
85. (go_north_west b7)
   changed: (x b7) from 4.5 to 3, (y b7) from 94.5 to 96
   goals met: 10 of 12
86. (go_north_west b7)
   changed: (x b7) from 3 to 1.5, (y b7) from 96 to 97.5
   goals met: 10 of 12
87. (go_north_west b7)
   changed: (x b7) from 1.5 to 0, (y b7) from 97.5 to 99
   goals met: 10 of 12
88. (save_person b7 p10)
   added: (saved p10)
   goals met: 11 of 12
89. (go_north_west b10)
   changed: (x b10) from 10 to 8.5, (y b10) from 9 to 10.5
   goals met: 11 of 12
90. (go_north_west b10)
   changed: (x b10) from 8.5 to 7, (y b10) from 10.5 to 12
   goals met: 11 of 12
91. (go_north_west b10)
   changed: (x b10) from 7 to 5.5, (y b10) from 12 to 13.5
   goals met: 11 of 12
92. (go_north_west b10)
   changed: (x b10) from 5.5 to 4, (y b10) from 13.5 to 15
   goals met: 11 of 12
93. (go_north_west b10)
   changed: (x b10) from 4 to 2.5, (y b10) from 15 to 16.5
   goals met: 11 of 12
94. (go_north_west b10)
   changed: (x b10) from 2.5 to 1, (y b10) from 16.5 to 18
   goals met: 11 of 12
95. (go_north_west b10)
   changed: (x b10) from 1 to -0.5, (y b10) from 18 to 19.5
   goals met: 11 of 12
96. (save_person b10 p1)
   added: (saved p1)
   goals met: 12 of 12
